src/Reports/КонтрольНаличияОригиналов/КонтрольНаличияОригиналов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>КонтрольНаличияОригиналов</name>
</mdclass:Report>

src/Enums/РазделыОтчетов/РазделыОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РазделыОтчетов</name>
  <enumValues>
    <name>ВнутренниеДокументыСписок</name>
  </enumValues>
  <enumValues>
    <name>ВходящиеДокументыСписок</name>
  </enumValues>
  <enumValues>
    <name>ДелаТомаСписок</name>
  </enumValues>
  <enumValues>
    <name>ЖурналПередачиСписок</name>
  </enumValues>
  <enumValues>
    <name>ЗадачиМнеСписок</name>
  </enumValues>
  <enumValues>
    <name>ЗадачиОтделаСписок</name>
  </enumValues>
  <enumValues>
    <name>ЗадачиСписок</name>
  </enumValues>
  <enumValues>
    <name>ИсходящиеДокументыСписок</name>
  </enumValues>
  <enumValues>
    <name>КонтрагентыСписок</name>
  </enumValues>
  <enumValues>
    <name>КонтрольСписок</name>
  </enumValues>
  <enumValues>
    <name>МероприятияСписок</name>
  </enumValues>
  <enumValues>
    <name>МониторингПроцессовСписок</name>
  </enumValues>
  <enumValues>
    <name>ОбращенияГражданСписок</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствияСписок</name>
  </enumValues>
  <enumValues>
    <name>ПисьмаСписок</name>
  </enumValues>
  <enumValues>
    <name>ПроектыСписок</name>
  </enumValues>
  <enumValues>
    <name>ПроцессыСписок</name>
  </enumValues>
  <enumValues>
    <name>СамочувствиеСотрудниковСписок</name>
  </enumValues>
  <enumValues>
    <name>ЭскалацияЗадач</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/КатегорииОтчетов/КатегорииОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииОтчетов</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>БезКатегории</name>
      <description>?</description>
    </items>
    <items>
      <name>Администрирование</name>
      <description>Администрирование</description>
    </items>
    <items>
      <name>ПоВнутреннимДокументам</name>
      <description>Внутренние документы</description>
    </items>
    <items>
      <name>ПоВходящимДокументам</name>
      <description>Входящие документы</description>
    </items>
    <items>
      <name>ПоИсходящимДокументам</name>
      <description>Исходящие документы</description>
    </items>
    <items>
      <name>КонтрольныеОтчеты</name>
      <description>Контрольные</description>
    </items>
    <items>
      <name>Просроченное</name>
      <description>О просрочке</description>
    </items>
    <items>
      <name>ПоОбращениямГраждан</name>
      <description>Обращения граждан</description>
    </items>
    <items>
      <name>ПерсональныеДанные</name>
      <description>Персональные данные</description>
    </items>
    <items>
      <name>ПланФакт</name>
      <description>План-факт</description>
    </items>
    <items>
      <name>ПоДокументам</name>
      <description>По всем документам</description>
    </items>
    <items>
      <name>ПоДоговорам</name>
      <description>По договорам</description>
    </items>
    <items>
      <name>ПоЗадачамИПроцессам</name>
      <description>По задачам и процессам</description>
    </items>
    <items>
      <name>ПоИсполнителям</name>
      <description>По исполнителям</description>
    </items>
    <items>
      <name>ПоКонтрагентам</name>
      <description>По контрагентам</description>
    </items>
    <items>
      <name>ПоМероприятиям</name>
      <description>По мероприятиям</description>
    </items>
    <items>
      <name>ПоПроектам</name>
      <description>По проектам</description>
    </items>
    <items>
      <name>Почта</name>
      <description>Почта</description>
    </items>
    <items>
      <name>Статистические</name>
      <description>Статистические</description>
    </items>
    <items>
      <name>ЭДО</name>
      <description>ЭДО</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Reports/КонтрольНаличияОригиналов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область НастройкиОтчетаПоУмолчанию

//Выполняет заполнение категорий и разделов в зависимости от варианта отчета
//Параметры:КлючВариантаОтчета - Строковое название варианта отчета
//			СписокКатегорий - в список добавляются необходимые категории
//			СписокРазделов - в список добавляются необходимые категории
Процедура ЗаполнитьСписокКатегорийИРазделовОтчета(КлючВариантаОтчета, СписокКатегорий, СписокРазделов) Экспорт
	
	СписокРазделов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
			Метаданные.Подсистемы.ДокументыИФайлы));
	
	Если КлючВариантаОтчета = "СписокДокументовБезОригиналов" Тогда
		
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ВнутренниеДокументыСписок);
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ВходящиеДокументыСписок);
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ИсходящиеДокументыСписок);
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.КонтрольныеОтчеты);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоДокументам);
		
	КонецЕсли;
	
	Если КлючВариантаОтчета = "СписокДокументовБезОригиналов" 
		Или КлючВариантаОтчета = "СтатистикаПоОригиналам" Тогда
		
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ВнутренниеДокументыСписок);
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ВходящиеДокументыСписок);
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ИсходящиеДокументыСписок);
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.КонтрольныеОтчеты);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоДокументам);
		
	КонецЕсли;
	
	Если КлючВариантаОтчета = "СтатистикаПоОригиналам" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.Статистические);
		
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
